<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head><meta name="generator" content="Hexo 3.9.0">
    <meta charset="utf-8">
<title>Skywind Inside Review - Cielmer</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">








    <meta name="description" content="&amp;#x6700;&amp;#x8FD1;&amp;#x5173;&amp;#x6CE8;&amp;#x4E86;&amp;#x4E00;&amp;#x4F4D;&amp;#x5927;&amp;#x725B;&amp;#x97E6;&amp;#x6613;&amp;#x7B11;&amp;#xFF0C;&amp;#x628A;&amp;#x4ED6;&amp;#x5230;&amp;#x76EE;&amp;#x524D;&amp;#x4E3A;&amp;#x6B62;&amp;#x7684;&amp;#x535A;&amp;#x6587;&amp;#x5927;&amp;#x81F4;">
<meta property="og:type" content="article">
<meta property="og:title" content="Skywind Inside Review">
<meta property="og:url" content="http://zxzsaga.github.io/2019/03/29/Skywind-Inside-Review/index.html">
<meta property="og:site_name" content="Cielmer">
<meta property="og:description" content="&amp;#x6700;&amp;#x8FD1;&amp;#x5173;&amp;#x6CE8;&amp;#x4E86;&amp;#x4E00;&amp;#x4F4D;&amp;#x5927;&amp;#x725B;&amp;#x97E6;&amp;#x6613;&amp;#x7B11;&amp;#xFF0C;&amp;#x628A;&amp;#x4ED6;&amp;#x5230;&amp;#x76EE;&amp;#x524D;&amp;#x4E3A;&amp;#x6B62;&amp;#x7684;&amp;#x535A;&amp;#x6587;&amp;#x5927;&amp;#x81F4;">
<meta property="og:locale" content="zh-cn">
<meta property="og:updated_time" content="2020-02-28T14:23:35.558Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Skywind Inside Review">
<meta name="twitter:description" content="&amp;#x6700;&amp;#x8FD1;&amp;#x5173;&amp;#x6CE8;&amp;#x4E86;&amp;#x4E00;&amp;#x4F4D;&amp;#x5927;&amp;#x725B;&amp;#x97E6;&amp;#x6613;&amp;#x7B11;&amp;#xFF0C;&amp;#x628A;&amp;#x4ED6;&amp;#x5230;&amp;#x76EE;&amp;#x524D;&amp;#x4E3A;&amp;#x6B62;&amp;#x7684;&amp;#x535A;&amp;#x6587;&amp;#x5927;&amp;#x81F4;">





<link rel="icon" href="/favicon.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">

<link rel="stylesheet" href="/css/style.css">

<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    

    


</head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                <img src="/images/logo.png" alt height="28">
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item " href="/archives/index.html">Archives</a>
            
            <a class="navbar-item " href="/categories/LifeStyle/index.html">Lifestyle</a>
            
            <a class="navbar-item " href="/categories/Music/index.html">Music</a>
            
            <a class="navbar-item " href="/categories/Technology/index.html">Technology</a>
            
            <a class="navbar-item " href="/about/index.html">About</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="GitHub" href="https://github.com/zxzsaga">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            Skywind Inside Review
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2019-03-29T11:00:06.000Z" itemprop="datePublished">3月 29 2019</time>
        </span>
        
        
        <span class="column is-narrow">
            
            
            13 分钟 读完 (约 1910 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <p>&#x6700;&#x8FD1;&#x5173;&#x6CE8;&#x4E86;&#x4E00;&#x4F4D;&#x5927;&#x725B;<a href="https://www.zhihu.com/people/skywind3000/activities" target="_blank" rel="noopener">&#x97E6;&#x6613;&#x7B11;</a>&#xFF0C;&#x628A;&#x4ED6;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x7684;<a href="http://www.skywind.me/blog/" target="_blank" rel="noopener">&#x535A;&#x6587;</a>&#x5927;&#x81F4;&#x6D4F;&#x89C8;&#x4E86;&#x4E00;&#x4E0B;&#x3002;&#x6211;&#x6BD4;&#x8F83;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x5185;&#x5BB9;&#x4E3B;&#x8981;&#x662F;&#x5173;&#x4E8E; <em>&#x6E38;&#x620F;&#x5F00;&#x53D1;&#x968F;&#x7B14;</em> &#x548C; <em>&#x7F51;&#x7EDC;&#x6E38;&#x620F;&#x6280;&#x672F;</em> &#x4E24;&#x90E8;&#x5206;&#x7684;&#x3002;&#x4ECA;&#x5929;&#x8BB0;&#x5F55;&#x4E00;&#x4E0B;&#x770B;&#x4E86;&#x4ED6;&#x4E00;&#x4E9B; <em>&#x6E38;&#x620F;&#x5F00;&#x53D1;&#x968F;&#x7B14;</em> &#x540E;&#x7684;&#x611F;&#x609F;&#x3002;</p>
<p>&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x6587;&#x7AE0;&#x6709;&#x4E09;&#x7BC7;&#xFF1A;</p>
<ul>
<li><a href="http://www.skywind.me/blog/archives/457#more-457" target="_blank" rel="noopener">&#x73B0;&#x5B9E;&#x4E3B;&#x4E49;&#x9898;&#x6750;&#x9700;&#x8981;&#x62EF;&#x6551;&#xFF08;2007&#xFF09;</a></li>
<li><a href="http://www.skywind.me/blog/archives/1259" target="_blank" rel="noopener">&#x4F60;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x79BB;&#x5F00;&#x6E38;&#x620F;&#x884C;&#x4E1A;&#xFF1F;&#xFF08;2015&#xFF09;</a></li>
<li><a href="http://www.skywind.me/blog/archives/1250#more-1250" target="_blank" rel="noopener">&#x4E8C;&#x5341;&#x5E74;&#x524D;&#x662F;&#x600E;&#x6837;&#x5F00;&#x53D1;&#x6E38;&#x620F;&#x7684;&#xFF1F;&#xFF08;2015&#xFF09;</a></li>
</ul>
<h1 id="&#x73B0;&#x5B9E;&#x4E3B;&#x4E49;&#x9898;&#x6750;&#x9700;&#x8981;&#x62EF;&#x6551;"><a href="#&#x73B0;&#x5B9E;&#x4E3B;&#x4E49;&#x9898;&#x6750;&#x9700;&#x8981;&#x62EF;&#x6551;" class="headerlink" title="&#x73B0;&#x5B9E;&#x4E3B;&#x4E49;&#x9898;&#x6750;&#x9700;&#x8981;&#x62EF;&#x6551;"></a>&#x73B0;&#x5B9E;&#x4E3B;&#x4E49;&#x9898;&#x6750;&#x9700;&#x8981;&#x62EF;&#x6551;</h1><p>&#x9996;&#x5148;&#x4ED6;&#x8C08;&#x5230;&#x7684;&#x662F;<em>&#x53C2;&#x8003;&#x6E38;&#x620F; vs &#x53C2;&#x8003;&#x751F;&#x6D3B;</em>&#x3002;&#x505A;&#x6E38;&#x620F;&#x4E0D;&#x5E94;&#x8BE5;&#x53EA;&#x53C2;&#x8003;&#x6E38;&#x620F;&#xFF0C;&#x800C;&#x5E94;&#x8BE5;&#x53C2;&#x8003;&#x751F;&#x6D3B;&#xFF0C;&#x56E0;&#x4E3A;&#x827A;&#x672F;&#x6E90;&#x4E8E;&#x751F;&#x6D3B;&#x3002;&#x73B0;&#x5728;&#x5F88;&#x591A;&#x4EBA;&#x5FD8;&#x4E86;&#x8FD9;&#x70B9;&#xFF0C;&#x6240;&#x4EE5;&#x505A;&#x4E0D;&#x51FA;&#x521B;&#x65B0;&#x3002;&#x6E38;&#x620F;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x8F7D;&#x4F53;&#xFF0C;&#x5C31;&#x50CF;&#x5C0F;&#x8BF4;&#x3001;&#x7535;&#x5F71;&#x4E00;&#x6837;&#x3002;&#x5B83;&#x6240;&#x627F;&#x8F7D;&#x7684;&#x5185;&#x5BB9;&#x624D;&#x662F;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x3002;&#x5982;&#x679C;&#x53EA;&#x5173;&#x5FC3;&#x505A;&#x6E38;&#x620F;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x800C;&#x4E0D;&#x6CE8;&#x91CD;&#x89C2;&#x5BDF;&#x751F;&#x6D3B;&#xFF0C;&#x53EF;&#x80FD;&#x5728;&#x201C;&#x672F;&#x201D;&#x4E0A;&#x80FD;&#x505A;&#x5230;&#x5F88;&#x9AD8;&#x7684;&#x6C34;&#x51C6;&#xFF0C;&#x4F46;&#x5374;&#x505A;&#x4E0D;&#x5230;&#x201C;&#x827A;&#x201D;&#x4E0A;&#x7684;&#x5408;&#x683C;&#xFF0C;&#x4ECE;&#x800C;&#x505A;&#x4E0D;&#x51FA;&#x6E38;&#x620F;&#x7684;&#x4F5C;&#x54C1;&#x3002;&#x6240;&#x4EE5;&#x505A;&#x6E38;&#x620F;&#x7684;&#x4E0D;&#x5E94;&#x8BE5;&#x4F4F;&#x5173;&#x6CE8;&#x6E38;&#x620F;&#x9886;&#x57DF;&#xFF0C;&#x800C;&#x5E94;&#x8BE5;&#x5173;&#x6CE8;&#x751F;&#x6D3B;&#x7684;&#x65B9;&#x65B9;&#x9762;&#x9762;&#xFF0C;&#x521B;&#x610F;&#x5F80;&#x5F80;&#x6765;&#x6E90;&#x4E8E;&#x8FD9;&#x4E9B;&#x5730;&#x65B9;&#xFF0C;<a href="https://en.wikipedia.org/wiki/Overcooked" target="_blank" rel="noopener">Overcooked</a> &#x5C31;&#x662F;&#x5F88;&#x597D;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<p>&#x5176;&#x6B21;&#x8C08;&#x5230;&#x4E86;<em>&#x521B;&#x65B0; vs &#x6539;&#x826F;</em>&#x3002;</p>
<blockquote>
<p>&#x4EBA;&#x7C7B;&#x65E2;&#x662F;&#x4F9D;&#x8D56;&#x4E60;&#x60EF;&#x7684;&#x52A8;&#x7269;&#xFF0C;&#x4E5F;&#x662F;&#x8FFD;&#x6C42;&#x65B0;&#x9C9C;&#x611F;&#x7684;&#x52A8;&#x7269;&#x3002;</p>
</blockquote>
<p>&#x597D;&#x7684;&#x6E38;&#x620F;&#x5E94;&#x8BE5;&#x5E73;&#x8861;&#x8FD9;&#x4E24;&#x70B9;&#xFF0C;&#x7C7B;&#x4F3C;&#x7684;&#x89C2;&#x70B9;&#x5728;<a href="https://www.gamasutra.com/blogs/PaulKilduffTaylor/20180824/325218/The_10_Secrets_to_Indie_Game_Success_and_Why_They_Do_Not_Exist.php" target="_blank" rel="noopener">&#x5F00;&#x53D1;&#x8005;&#xFF1A;&#x72EC;&#x7ACB;&#x6E38;&#x620F;&#x7684;&#x5341;&#x4E2A;&#x6210;&#x529F;&#x79D8;&#x8BC0;&#xFF08;&#x4EE5;&#x53CA;&#x4E3A;&#x4EC0;&#x4E48;&#x5B83;&#x4EEC;&#x4E0D;&#x5B58;&#x5728;&#xFF09;</a>&#x4E00;&#x6587;&#x4E2D;&#x4E5F;&#x6709;&#x6240;&#x8C08;&#x5230;&#x3002;&#x719F;&#x6089;&#x611F;&#x80FD;&#x8BA9;&#x73A9;&#x5BB6;&#x5C06;&#x4F5C;&#x54C1;&#x4E0E;&#x4E4B;&#x524D;&#x7684;&#x7F8E;&#x597D;&#x8BB0;&#x5FC6;&#x8054;&#x7CFB;&#x8D77;&#x6765;&#xFF0C;&#x5E76;&#x88AB;&#x5B83;&#x5438;&#x5F15;&#xFF1B;&#x65B0;&#x9896;&#x6027;&#x4E3A;&#x73A9;&#x5BB6;&#x5E26;&#x6765;&#x4EE4;&#x4EBA;&#x5174;&#x594B;&#x7684;&#x65B0;&#x9C9C;&#x611F;&#x53D7;&#x3002;&#x505A;&#x7684;&#x6E38;&#x620F;&#x4E0D;&#x5E94;&#x8BE5;&#x592A;&#x8001;&#x5957;&#xFF0C;&#x4E5F;&#x4E0D;&#x5E94;&#x8BE5;&#x592A;&#x8FC7;&#x65B0;&#x9896;&#x8BA9;&#x4EBA;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x8BDD;&#x9898;&#x662F;<em>&#x73B0;&#x4EE3;&#x9898;&#x6750; vs &#x53E4;&#x5178;&#x9898;&#x6750;</em>&#x3002;&#x6211;&#x4EEC;&#x80CC;&#x8D1F;&#x4E86;&#x4E94;&#x5343;&#x5E74;&#x6587;&#x5316;&#x7684;&#x5927;&#x5305;&#x88B1;&#xFF0C;&#x5F88;&#x5C11;&#x6709;&#x5173;&#x4E8E;&#x73B0;&#x4EE3;&#x9898;&#x6750;&#x7684;&#x4F18;&#x79C0;&#x6E38;&#x620F;&#x3002;&#x5927;&#x5382;&#x4E0D;&#x613F;&#x610F;&#x505A;&#x73B0;&#x4EE3;&#x9898;&#x6750;&#xFF0C;&#x53EA;&#x6709;&#x67D0;&#x4E9B;&#x4E2A;&#x4EBA;&#x7684;&#x7075;&#x5149;&#x4E4D;&#x73B0;&#xFF0C;&#x624D;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E9B;&#x73B0;&#x4EE3;&#x9898;&#x6750;&#x6E38;&#x620F;&#xFF0C;&#x50CF;<em>&#x6F5C;&#x4F0F;&#x4E4B;&#x8D64;&#x9014;/&#x9690;&#x5F62;&#x5B88;&#x62A4;&#x8005;</em>&#x7684;&#x4F18;&#x79C0;&#x6E38;&#x620F;&#x592A;&#x5C11;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x59CB;&#x7EC8;&#x4E0D;&#x662F;&#x4E3B;&#x6D41;&#x3002;</p>
<p>&#x6211;&#x4E00;&#x76F4;&#x8BA4;&#x4E3A;&#x628A;&#x6B66;&#x4FA0;&#x7684;&#x7CBE;&#x795E;&#x4EE3;&#x5165;&#x73B0;&#x4EE3;&#x9898;&#x6750;&#x6709;&#x7740;&#x5F88;&#x597D;&#x7684;&#x610F;&#x4E49;&#xFF0C;&#x6B66;&#x4FA0;&#x662F;&#x4E00;&#x79CD;&#x7CBE;&#x795E;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x529F;&#x592B;&#x3002;&#x76EE;&#x524D;&#x770B;&#x6765;&#xFF0C;&#x76F8;&#x5BF9;&#x4E8E;&#x56FD;&#x5185;&#x7684;&#x7814;&#x53D1;&#x6C34;&#x5E73;&#xFF0C;&#x505A;&#x8FD9;&#x6837;&#x7684;&#x6E38;&#x620F;&#x592A;&#x8FC7;&#x5192;&#x9669;&#x3001;&#x592A;&#x8FC7;&#x5B8F;&#x5927;&#x4E86;&#xFF0C;&#x4E0D;&#x8FC7;&#x6211;&#x76F8;&#x4FE1;&#x4EE5;&#x540E;&#x4F1A;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x4F5C;&#x54C1;&#x7684;&#xFF0C;</p>
<p><a href="http://www.skywind.me/blog/archives/457#more-457" target="_blank" rel="noopener">&#x73B0;&#x5B9E;&#x4E3B;&#x4E49;&#x9898;&#x6750;&#x9700;&#x8981;&#x62EF;&#x6551;</a>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4F5C;&#x4E8E;2007&#x5E74;&#xFF0C;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;2019&#x5E74;&#xFF0C;&#x6587;&#x4E2D;&#x6240;&#x63D0;&#x5230;&#x7684;&#x95EE;&#x9898;&#x4F9D;&#x65E7;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x89E3;&#x51B3;&#x3002;&#x5927;&#x725B;&#x80FD;&#x5728;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x5C31;&#x6709;&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#x4E5F;&#x4E0D;&#x5BB9;&#x6613;&#xFF0C;&#x800C;&#x5341;&#x51E0;&#x5E74;&#x8FC7;&#x53BB;&#x4E86;&#x5728;&#x8FD9;&#x4E9B;&#x65B9;&#x9762;&#x4E00;&#x70B9;&#x513F;&#x8FDB;&#x6B65;&#x4E5F;&#x6CA1;&#x6709;&#x4E5F;&#x662F;&#x96BE;&#x5F97;&#x2026;&#x2026;</p>
<p>&#x4E0D;&#x8FC7;&#x633A;&#x597D;&#x7684;&#xFF0C;&#x6709;&#x95EE;&#x9898;&#x624D;&#x6709;&#x673A;&#x4F1A;&#xFF0C;&#x4E0D;&#x7136;&#x6211;&#x4EEC;&#x8FD9;&#x4E9B;&#x4EBA;&#x5E72;&#x561B;&#x5462;&#xFF1F;</p>
<h1 id="&#x4E8C;&#x5341;&#x5E74;&#x524D;&#x662F;&#x600E;&#x6837;&#x5F00;&#x53D1;&#x6E38;&#x620F;&#x7684;&#xFF1F;"><a href="#&#x4E8C;&#x5341;&#x5E74;&#x524D;&#x662F;&#x600E;&#x6837;&#x5F00;&#x53D1;&#x6E38;&#x620F;&#x7684;&#xFF1F;" class="headerlink" title="&#x4E8C;&#x5341;&#x5E74;&#x524D;&#x662F;&#x600E;&#x6837;&#x5F00;&#x53D1;&#x6E38;&#x620F;&#x7684;&#xFF1F;"></a>&#x4E8C;&#x5341;&#x5E74;&#x524D;&#x662F;&#x600E;&#x6837;&#x5F00;&#x53D1;&#x6E38;&#x620F;&#x7684;&#xFF1F;</h1><p>&#x554A;&#xFF0C;&#x5927;&#x6982;&#x5C31;&#x662F;&#x8BF4;20&#x5E74;&#x5F00;&#x53D1;&#x6E38;&#x620F;&#x5DE8;&#x9EBB;&#x70E6;&#xFF0C;&#x4EC0;&#x4E48;&#x90FD;&#x8981;&#x81EA;&#x5DF1;&#x5B9E;&#x73B0;&#xFF0C;&#x8FD8;&#x6CA1;&#x6709;&#x8D44;&#x6599;&#x67E5;&#x3002;&#x52B1;&#x5FD7;&#x7684;&#x662F;&#x6700;&#x540E;&#x4E24;&#x6BB5;&#xFF1A;</p>
<blockquote>
<p>&#x884C;&#x4E1A;&#x603B;&#x662F;&#x8981;&#x53D1;&#x5C55;&#x7684;&#xFF0C;&#x6211;&#x4E5F;&#x4ECE;&#x300A;&#x7F16;&#x7A0B;&#x6280;&#x5DE7;&#x4E0E;&#x7EF4;&#x62A4;&#x300B;&#x300A;VGA&#x663E;&#x793A;&#x539F;&#x7406;&#x300B;&#x3002;&#x3002;&#x3002;&#x548C;&#x5404;&#x79CD;&#x6742;&#x5FD7;&#x4E0A;&#x83B7;&#x53D6;&#x4E86;&#x4E0D;&#x5C11;&#x77E5;&#x8BC6;&#xFF0C;&#x5F53;&#x5E74;&#x5199;&#x8FD9;&#x4E9B;&#x6587;&#x7AE0;&#x7684;&#x4EBA;&#xFF0C;&#x548C;&#x8EAB;&#x8FB9;&#x641E;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#xFF0C;&#x90FD;&#x6BD4;&#x6211;&#x5927;&#x5F88;&#x591A;&#xFF0C;&#x6211;&#x5E7C;&#x5C0F;&#x7684;&#x5FC3;&#x7075;&#x91CC;&#x603B;&#x6709;&#x4E00;&#x4EFD;&#x51B2;&#x52A8;&#xFF0C;&#x51A5;&#x51A5;&#x4E4B;&#x4E2D;&#x89C9;&#x5F97;&#x5C06;&#x6765;&#x81EA;&#x5DF1;&#x80AF;&#x5B9A;&#x80FD;&#x8D85;&#x8FC7;&#x4ED6;&#x4EEC;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x770B;&#x4E0D;&#x8D77;&#x5979;&#x4EEC;&#xFF0C;&#x5F02;&#x6216;&#x6211;&#x72C2;&#x5984;&#x81EA;&#x5927;&#xFF0C;&#x800C;&#x662F;&#x53EA;&#x6709;&#x8FD9;&#x6837;&#xFF0C;&#x7AD9;&#x5728;&#x5979;&#x4EEC;&#x80A9;&#x4E0A;&#xFF0C;&#x624D;&#x80FD;&#x5BF9;&#x5F97;&#x8D77;&#x5927;&#x5BB6;&#x5171;&#x540C;&#x7231;&#x597D;&#x7684;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#xFF0C;&#x5927;&#x5BB6;&#x5171;&#x540C;&#x8FFD;&#x6C42;&#x7684;&#x4E8B;&#x4E1A;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x800C;&#x4ECA;&#x5929;&#xFF0C;&#x6211;&#x4F1A;&#x5C3D;&#x91CF;&#x5229;&#x7528;&#x4E1A;&#x4F59;&#x65F6;&#x95F4;&#xFF0C;&#x4E8E;&#x5404;&#x5904;&#x57F9;&#x8BAD;&#x6E38;&#x620F;&#x5F00;&#x53D1;&#xFF0C;&#x5E2E;&#x52A9;&#x5927;&#x5BB6;&#x8BE5;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x5404;&#x79CD;&#x4E1C;&#x897F;&#xFF0C;&#x76EE;&#x7684;&#x4E5F;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#xFF0C;&#x8BA9;&#x4ECA;&#x5929;&#x7684;&#x5C0F;&#x5B69;&#x5C06;&#x6765;&#x6709;&#x4E00;&#x5929;&#x80FD;&#x591F;&#x8D85;&#x8FC7;&#x6211;&#xFF0C;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x5979;&#x4EEC;&#x72C2;&#x5984;&#x81EA;&#x5927;&#xFF0C;&#x5F02;&#x6216;&#x6211;&#x5984;&#x81EA;&#x83F2;&#x8584;&#xFF0C;&#x800C;&#x662F;&#x56E0;&#x4E3A;&#x53EA;&#x6709;&#x8FD9;&#x6837;&#xFF0C;&#x8BA9;&#x5979;&#x4EEC;&#x7AD9;&#x5728;&#x6211;&#x7684;&#x80A9;&#x4E0A;&#xFF0C;&#x624D;&#x80FD;&#x5BF9;&#x5F97;&#x8D77;&#x5927;&#x5BB6;&#x5171;&#x540C;&#x7231;&#x597D;&#x7684;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#xFF0C;&#x5927;&#x5BB6;&#x5171;&#x540C;&#x8FFD;&#x6C42;&#x7684;&#x8FD9;&#x4E2A;&#x4E8B;&#x4E1A;&#x3002;</p>
</blockquote>
<p>&#x592A;&#x52B1;&#x5FD7;&#x4E86;&#xFF08;&#x6447;&#x4E86;&#x6447;&#x5934;&#xFF0C;&#x81EA;&#x53F9;&#x4E0D;&#x5982;&#xFF09;&#x3002;</p>
<h1 id="&#x4F60;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x79BB;&#x5F00;&#x6E38;&#x620F;&#x884C;&#x4E1A;&#xFF1F;"><a href="#&#x4F60;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x79BB;&#x5F00;&#x6E38;&#x620F;&#x884C;&#x4E1A;&#xFF1F;" class="headerlink" title="&#x4F60;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x79BB;&#x5F00;&#x6E38;&#x620F;&#x884C;&#x4E1A;&#xFF1F;"></a>&#x4F60;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x79BB;&#x5F00;&#x6E38;&#x620F;&#x884C;&#x4E1A;&#xFF1F;</h1><ul>
<li>&#x6E38;&#x620F;&#x4EA7;&#x54C1;&#x6210;&#x529F;&#x7387;&#x53EA;&#x6709;1%&#xFF0C;&#x505A;&#x6E38;&#x620F;&#x6210;&#x8D25;&#x72B9;&#x5982;&#x5F00;&#x5B9D;&#x7BB1;&#x3002;</li>
<li>&#x505A;&#x6E38;&#x620F;&#x4E0D;&#x53EF;&#x6301;&#x7EED;&#x53D1;&#x5C55;&#xFF0C;&#x505A;&#x6E38;&#x620F;&#x4E0D;&#x5982;&#x505A;&#x5E94;&#x7528;&#x3002;</li>
<li>&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x5931;&#x53BB;&#x4E3B;&#x5BFC;&#x3002;</li>
<li>&#x6E38;&#x620F;&#x5F00;&#x53D1;&#x6210;&#x672C;&#x6301;&#x7EED;&#x4E0A;&#x5347;&#xFF0C;&#x521B;&#x4E1A;&#x8D8A;&#x6765;&#x8D8A;&#x96BE;&#x3002;</li>
<li>&#x52A3;&#x5E01;&#x9A71;&#x9010;&#x826F;&#x5E01;&#x3002;</li>
<li>&#x5927;&#x5BB6;&#x90FD;&#x53EA;&#x5173;&#x5FC3;&#x94B1;&#xFF0C;&#x4E0D;&#x5173;&#x5FC3;&#x6E38;&#x620F;&#x4E86;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x63A8;&#x8350;&#x53BB;&#x770B;&#x539F;&#x6587;<a href="http://www.skywind.me/blog/archives/1259" target="_blank" rel="noopener"><em>&#x4F60;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x79BB;&#x5F00;&#x6E38;&#x620F;&#x884C;&#x4E1A;&#xFF1F;</em></a> &#x603B;&#x7ED3;&#x4E00;&#x53E5;&#x8BDD;&#x5C31;&#x662F;&#xFF1A;&#x505A;&#x6E38;&#x620F;&#x8D5A;&#x94B1;&#x8D8A;&#x6765;&#x8D8A;&#x96BE;&#x4E86;&#x3002;</p>
<p>&#x6587;&#x7AE0;&#x6700;&#x540E;&#x7ED9;&#x51FA;&#x4E00;&#x7897;&#x9E21;&#x6C64;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF1A;&#x505A;&#x7CBE;&#x54C1;&#x6E38;&#x620F;&#x3001;&#x62FC;&#x8D28;&#x91CF;&#x3002;</p>
<blockquote>
<p>&#x5927;&#x5BB6;&#x53EA;&#x6709;&#x91CD;&#x65B0;&#x627E;&#x51C6;&#x4EA7;&#x54C1;&#x65B9;&#x5411;&#xFF0C;&#x5728;&#x5185;&#x5BB9;&#x548C;&#x54C1;&#x8D28;&#x4E0A;&#x5B9E;&#x73B0;&#x65B0;&#x7684;&#x7A81;&#x7834;&#xFF0C;&#x7EE7;&#x7EED;&#x628A;&#x884C;&#x4E1A;&#x95E8;&#x69DB;&#x63A8;&#x9AD8;&#xFF0C;&#x63D0;&#x5347;&#x73A9;&#x5BB6;&#x5BA1;&#x7F8E;&#x3002;&#x628A;&#x6240;&#x8C13;&#x7684;&#x5927;&#x5B66;&#x751F;&#x90FD;&#x80FD;&#x505A;&#x7684;&#x5783;&#x573E;&#x6E38;&#x620F;&#x4EEC;&#x9001;&#x8FDB;&#x575F;&#x5893;&#xFF0C;&#x7ED3;&#x675F;&#x76EE;&#x524D;&#x7684;&#x6DF7;&#x4E71;&#xFF0C;&#x8BA9;&#x6E38;&#x620F;&#x5C06;&#x91CD;&#x65B0;&#x56DE;&#x5230;&#x4E0D;&#x662F;&#x8C01;&#x90FD;&#x80FD;&#x505A;&#x7684;&#x5E74;&#x4EE3;&#xFF0C;&#x7528;&#x4E00;&#x6B3E;&#x6B3E;&#x4F18;&#x79C0;&#x7684;&#x4F5C;&#x54C1;&#x544A;&#x8BC9;&#x6E20;&#x9053;&#x548C;&#x7528;&#x6237;&#xFF0C;&#x4EC0;&#x4E48;&#x624D;&#x53EB;&#x771F;&#x6B63;&#x7684;&#x6E38;&#x620F;&#x3002;&#x82F9;&#x679C;&#x80FD;&#x5728;&#x624B;&#x673A;&#x6CDB;&#x6EE5;&#x5230;&#x5904;&#x5C71;&#x5BE8;&#x5316;&#x7684;&#x65E5;&#x5B50;&#x91CC;&#xFF0C;&#x91CD;&#x65B0;&#x627E;&#x5230;&#x7A81;&#x7834;&#x3002;&#x4ECA;&#x5E74;&#x4E0A;&#x534A;&#x5E74;&#x4E0A;&#x7EBF;&#x7684;&#x82E5;&#x5E72;3A&#x5927;&#x4F5C;&#xFF0C;&#x4EFB;&#x7136;&#x80FD;&#x5728;&#x540C;&#x8D28;&#x5316;&#x4E25;&#x91CD;&#x7684;&#x624B;&#x6E38;&#x5E02;&#x573A;&#x8131;&#x9896;&#x800C;&#x51FA;&#xFF0C;&#x7ED3;&#x675F;&#x4E86;&#x81EA;2013&#x5E74;&#x4E0A;&#x534A;&#x5E74;&#x6765;&#x6E20;&#x9053;&#x88AB;&#x65E0;&#x9650;&#x653E;&#x5927;&#x7684;&#x4E71;&#x8C61;&#x3002;&#x51ED;&#x501F;&#x7684;&#x90FD;&#x4E0D;&#x662F;&#x5BA3;&#x4F20;&#xFF0C;&#x66F4;&#x4E0D;&#x662F;&#x6E20;&#x9053;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x9897;&#x9897;&#x4E0D;&#x7518;&#x6C89;&#x6CA6;&#x7684;&#x5FC3;&#xFF0C;&#x548C;&#x624E;&#x624E;&#x5B9E;&#x5B9E;&#x591A;&#x5E74;&#x6478;&#x722C;&#x6EDA;&#x6253;&#x79EF;&#x7D2F;&#x7684;&#x7ECF;&#x9A8C;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x5F53;&#x7136;&#xFF0C;&#x53EA;&#x6709;&#x8FD9;&#x6837;&#xFF0C;&#x884C;&#x4E1A;&#x4EF7;&#x503C;&#x4ECE;&#x6E20;&#x9053;&#x56DE;&#x5F52;&#x4EA7;&#x54C1;&#x672C;&#x8EAB;&#xFF0C;&#x624D;&#x80FD;&#x8BA9;&#x6574;&#x4E2A;&#x884C;&#x4E1A;&#x66F4;&#x7406;&#x6027;&#x5065;&#x5EB7;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E5F;&#x53EA;&#x6709;&#x8FD9;&#x6837;&#xFF0C;&#x7528;&#x4E00;&#x4E2A;&#x4E2A;&#x7684;&#x7CBE;&#x54C1;&#x6E38;&#x620F;&#xFF0C;&#x91CD;&#x65B0;&#x5C06;&#x9879;&#x76EE;&#x53D8;&#x56DE;&#x4E8B;&#x4E1A;&#xFF0C;&#x5F00;&#x53D1;&#x7EC4;&#x624D;&#x80FD;&#x627E;&#x56DE;&#x6614;&#x65E5;&#x901D;&#x53BB;&#x7684;&#x5C0A;&#x4E25;&#x3002;&#x5230;&#x90A3;&#x65F6;&#xFF0C;&#x6E20;&#x9053;&#x5F53;&#x7136;&#x5076;&#x5C14;&#x4E5F;&#x53EF;&#x4EE5;&#x62DB;&#x8058;&#x4E00;&#x4E24;&#x4E2A;&#x5927;&#x5B66;&#x751F;&#xFF0C;&#x505A;&#x4E9B;&#x68CB;&#x724C;&#x548C;&#x8DD1;&#x9177;&#x5A31;&#x4E50;&#x4E0B;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x90A3;&#x53EB;&#x505A;&#x73A9;&#x5177;&#xFF0C;&#x4E0D;&#x80FD;&#x79F0;&#x5176;&#x4E3A; &#x201C;&#x6E38;&#x620F;&#x4F5C;&#x54C1;&#x201D; &#x3002;</p>
</blockquote>
<p>&#x6211;&#x4EE5;&#x4E3A;&#x53EA;&#x6709;&#x5E74;&#x7EAA;&#x6BD4;&#x8F83;&#x5C0F;&#x7684;&#x4EBA;&#x624D;&#x4F1A;&#x4E2D;&#x4E8C;&#x5462;&#xFF0C;&#x54C8;&#x54C8;&#xFF0C;&#x770B;&#x6765;&#x4F5C;&#x8005;&#x662F;&#x771F;&#x7684;&#x70ED;&#x7231;&#x8FD9;&#x884C;&#xFF0C;&#x800C;&#x4E14;&#x5F88;&#x4E50;&#x89C2;&#xFF0C;&#x8FD9;&#x6BD4;&#x8FD9;&#x6BB5;&#x8BDD;&#x66F4;&#x5BB9;&#x6613;&#x9F13;&#x52B1;&#x4EBA;&#x3002;</p>
<hr>
<p>&#x5927;&#x725B;&#x7684;&#x535A;&#x5BA2;&#x91CC;&#x8FD8;&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x7BC7;&#x5947;&#x8469;&#xFF1A;<a href="http://www.skywind.me/blog/archives/204" target="_blank" rel="noopener">&#x6BD4;&#x5C14;&#xB7;&#x4E91;&#x98CE;&#x4F20;&#x5947;</a>&#xFF0C;&#x8C8C;&#x4F3C;&#x8BB2;&#x7684;&#x662F;<a href="https://blog.codingnow.com/" target="_blank" rel="noopener">&#x4E91;&#x98CE;</a>&#x5927;&#x725B;&#x3002;&#x4EE5;&#x524D;&#x7F51;&#x6613;&#x7684;&#x5927;&#x725B;&#x8FD8;&#x771F;&#x591A;&#x554A;&#x3002;</p>

    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop  article-nav-prev">
            
            <a href="/2019/12/20/SubsetGames/index.html">SubsetGames</a>
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/2019/03/22/Sekiro-Release/index.html">生日礼物：《只狼：影逝二度》</a>
            
        </span>
    </div>
    
</article>




    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 Cielmer&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="渝ICP备19006622号-1" href="http://www.beian.miit.gov.cn">
                    
                    渝ICP备19006622号-1
                    
                </a>
                
                    
                <a class="column is-narrow has-text-black" title="GitHub" href="https://github.com/zxzsaga">
                    
                    GitHub
                    
                </a>
                
                </div>
            </div>
            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    


<script src="/js/script.js"></script>

    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索">
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>
<script src="/js/insight.js"></script>
    
</body>
</html>